{
    "_name_or_path": "output/init_model/init_0828/",
    "architectures": [
      "MegrezO"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "audio": {
      "add_audio_bos_eos_token": true,
      "audio_start_id": 64795,
      "avg_pool": true,
      "n_ctx": 1500,
      "n_head": 20,
      "n_layer": 32,
      "n_mels": 128,
      "n_state": 1280,
      "output_dim": 2560
    },
    "auto_map": {
      "AutoModel": "modeling_megrezo.MegrezO",
      "AutoModelForCausalLM": "modeling_megrezo.MegrezO"
    },
    "bos_token_id": null,
    "drop_vision_last_layer": false,
    "eos_token_id": 120005,
    "hidden_act": "silu",
    "hidden_size": 2560,
    "initializer_range": 0.02,
    "intermediate_size": 7168,
    "max_position_embeddings": 4096,
    "max_sequence_length": 4096,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 40,
    "num_hidden_layers": 32,
    "num_key_value_heads": 10,
    "pad_token_id": 0,
    "patch_size": 14,
    "pretraining_tp": 1,
    "query_num": 64,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 5000000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.0",
    "use_cache": false,
    "vision_batch_size": 8,
    "vision_config": {
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "attention_dropout": 0.0,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": null,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "hidden_act": "gelu_pytorch_tanh",
      "hidden_size": 1152,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "image_size": 980,
      "intermediate_size": 4304,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "layer_norm_eps": 1e-06,
      "length_penalty": 1.0,
      "max_length": 20,
      "min_length": 0,
      "model_type": "siglip_vision_model",
      "no_repeat_ngram_size": 0,
      "num_attention_heads": 16,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_channels": 3,
      "num_hidden_layers": 27,
      "num_return_sequences": 1,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": null,
      "patch_size": 14,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "sep_token_id": null,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torch_dtype": null,
      "torchscript": false,
      "typical_p": 1.0,
      "use_bfloat16": false
    },
    "vocab_size": 122880
  }
  